package Final_Exam.display;

import java.awt.*;
import javax.swing.*;

class StartGameFrame {
	private static JPanel panel;
	public static JPanel createGamePanel() {
		panel = new JPanel();

		String[] story = {
			"ในวันเปิดภาคเรียน นักศึกษาหนุ่มคนหนึ่งก้าวเข้าสู่มหาวิทยาลัยชั้นนำของประเทศ สถานที่ซึ่งขึ้นชื่อว่า \"สร้างอัจฉริยะ\" และ \"กลืนกินคนอ่อนแอ\"\n" +
			"ไปพร้อมกัน เขาเลือกสาขาวิชาที่ไม่มีอยู่ในหลักสูตรทั่วไป สาขาที่ถูกระบุไว้เพียงว่า \"สาขาวิชาพิเศษ\" โดยไม่มีคำอธิบายใดเพิ่มเติม ทันทีที่ประตู\n" +
			"มหาวิทยาลัยปิดลง ม่านหมอกพิษสีหม่นก็แผ่ ขยายออกมา กลืนกินโลกภายนอกจนไม่เหลือแม้แต่สัญญาณการสื่อสาร ผู้ที่พยายามหลบหนี ล้มตาย ผู้\n",
			"ที่พยายามต่อต้าน หายสาบสูญ และผู้ที่ยอมจำนน... ค่อย ๆ สูญเสียความเป็นมนุษย์ นักศึกษาค้นพบความจริงอันโหดร้าย ที่นี่ไม่ใช่สถานศึกษา\n" +
			"แต่คือสนามทดลอง ความรู้ไม่ใช่เครื่องมือเพื่อพัฒนา แต่คือ อาวุธ เกรดไม่ใช่ตัวชี้วัดความ สามารถ แต่คือ เส้นแบ่งระหว่างชีวิตและความตาย",
			"เหนือมหาวิทยาลัยแห่งนี้ มี \"ผู้ปกครอง\" ปกครองอยู่ แต่ละคนครอบครองศาสตร์ ต้องห้าม แข็งแกร่งเกินกว่านักศึกษาจะต่อต้านได้ พวกเขาควบคุม\n" +
			"หลักสูตร บิดเบือนความ จริง และคัดเลือกเฉพาะผู้ที่ \"เหมาะสมจะรอด\"",
			"ท่ามกลางความสิ้นหวัง มีตำนานต้องห้ามถูกกระซิบต่อกันในหมู่นักศึกษาเงามืด \"หากผู้ใดมีจิตใจที่ไม่แตกสลาย มีสติปัญญาที่ไม่ยอมศิโรราบ และ\n" +
			"สามารถโค่นล้มผู้ ปกครองทั้งหมดลงได้ ม่านหมอกจะจางหาย และประตูสู่โลกภายนอกจะเปิดอีกครั้ง\""
		};

		return panel;
	}
}
